app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `authorizations` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2013-01-01 09:30:13', 'facebook', '100001818295482', '2013-01-01 09:30:13', 3)
---
  def create

    auth_hash = request.env['omniauth.auth']
    if session[:user_id]
      @user = User.find_by_id(session[:user_id])
      sign_in(@user)
      # Means our user is signed in. Add the authorization to the user
      User.find(session[:user_id]).add_provider(auth_hash)
      #render :text => "You can now login using #{auth_hash["provider"].capitalize} too!"
      #flash[:notice] = "You can now login using #{auth_hash["provider"].capitalize} too!"
    else
      # Log him in or sign him up
      auth = Authorization.find_or_create(auth_hash)