app/controllers/tasks_controller.rb

  def show
    @task = current_user.tasks.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 17 LIMIT 1

  def edit
    @task = current_user.tasks.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 21 LIMIT 1

  def create
    @task = current_user.tasks.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`check`, `content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES (1, 'bdfb', '2013-01-04 08:18:13', 'dgb', '2013-01-04 08:18:13', 1)

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `content` = 'rgre', `check` = 0, `updated_at` = '2013-01-04 08:33:56' WHERE `tasks`.`id` = 17

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 8 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 8